---
kind: other
id: Properties.T:Autodesk.Revit.DB.SunAndShadowSettings
source: html/46b677e8-991c-b238-8aa9-0e2bdc2d91ba.htm
---
# SunAndShadowSettings Properties

Identifies the active animation frame for a single-day or multi-day study,
 starting at 1.0 for the first frame and incrementing in intervals of 1.0.